const emoji = {
  angry: [",,Ծ‸Ծ,,", "(╯‵□′)╯︵┻━┻", "╰（‵□′）╯"],
  happy: [
    "=‿=✧",
    "●ω●",
    "(°▽°)ﾉ",
    "(/ ▽ \\)",
    "(=・ω・=)",
    "(●'◡'●)ﾉ♥",
    "<(▰˘◡˘▰)>",
    "(⁄ ⁄•⁄ω⁄•⁄ ⁄)",
    "(ง,,• ᴗ •,,)ง ✧",
    ">ㅂ<ﾉ ☆",
    "ヽ(✿ﾟ▽ﾟ)ノ",
    "✪ ω ✪",
    "(*ﾟ▽ﾟ*)"
  ],
  shock: ["Σ( ° △ °|||)︴", "(ﾟДﾟ≡ﾟдﾟ)!?", "∑(っ °Д °;)っ", "Σ(ﾟдﾟ;)"],
  sad: ["＞︿＜", "＞△＜", "●︿●", "(´；ω；`)", "( ´･_･)ﾉ(._.`)"],
  helpless: [
    "◐▽◑",
    "ʅ（´◔౪◔）ʃ",
    "_(:3 」∠)_",
    "_(:3」∠ ❀)_",
    "_(┐「ε:)_",
    "←◡←",
    "_(•̀ᴗ•́ 」∠ ❀)_",
    "_φ(･ω･` )",
    "¯\\_(ツ)_/¯"
  ]
} as const

export function randomEmoji(type: keyof typeof emoji): string {
  return emoji[type][Math.round(Math.random() * (emoji[type].length - 1))]
}
